Documents/ОтгрузкаТоваровСХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтгрузкаТоваровСХранения</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_УчетСерийныхНомеровПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяИнформацияПоДоставке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОсобыеУсловияПеревозкиОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>АдресДоставкиПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтпустилДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЗаказКлиента</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КодСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НоменклатураПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидыЗапасов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПеремещениеТоваровМеждуФилиалами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаПродукцииИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаХранениеСПравомПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтгрузкаПринятыхСПравомПродажиТоваровСХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОтгрузкаТоваровСХранения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ТТМ_ПередСозданиемНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;

	ОснованиеПриемка = ТТМ_ОпределитьОснованиеПриемки();
	Если ОснованиеПриемка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ТТМ_ПриемкаСодержитТоварыСУчетомСерий(ОснованиеПриемка) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(
			"Создание документа 'Отгрузка товаров с хранения' на основании приемки запрещено."
			+ Символы.ПС
			+ "Для товаров с учетом серий используйте АРМ 'Выпуск и реализация'.");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТТМ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Если Не Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;

	ОснованиеПриемка = ТТМ_ОпределитьОснованиеПриемки();
	Если ОснованиеПриемка = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТТМ_ЗаполнитьОтгрузкуПоПриемке(ОснованиеПриемка);

КонецПроцедуры

&НаСервере
Функция ТТМ_ОпределитьОснованиеПриемки()

	Если ЗначениеЗаполнено(Объект.ДокументОснование)
		И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		Возврат Объект.ДокументОснование;
	КонецЕсли;

	Если Параметры.Свойство("ЗначенияЗаполнения")
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ДокументОснование")
		И ТипЗнч(Параметры.ЗначенияЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ПриемкаТоваровНаХранение") Тогда
		Возврат Параметры.ЗначенияЗаполнения.ДокументОснование;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

&НаСервере
Функция ТТМ_ПриемкаСодержитТоварыСУчетомСерий(ОснованиеПриемка)

	ДокументПриемки = ОснованиеПриемка.ПолучитьОбъект();
	Если ДокументПриемки = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Для Каждого СтрокаПриемки Из ДокументПриемки.Товары Цикл
		Если ЗначениеЗаполнено(СтрокаПриемки.Номенклатура)
			И ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(СтрокаПриемки.Номенклатура) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

&НаСервере
Процедура ТТМ_ЗаполнитьОтгрузкуПоПриемке(ОснованиеПриемка)

	ДокументПриемки = ОснованиеПриемка.ПолучитьОбъект();
	Если ДокументПриемки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Объект.Основание = ОснованиеПриемка;
	Объект.ПоЗаказу = Ложь;
	Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ОтгрузкаПринятыхСПравомПродажиТоваровСХранения");

	ЗаполнитьЗначенияСвойств(
		Объект,
		ДокументПриемки,
		"Организация,Партнер,Контрагент,Подразделение,Склад,Договор,НаправлениеДеятельности,Комментарий");

	Объект.Товары.Очистить();
	Для Каждого СтрокаПриемки Из ДокументПриемки.Товары Цикл
		Если Не ЗначениеЗаполнено(СтрокаПриемки.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(
			НоваяСтрока,
			СтрокаПриемки,
			"Номенклатура,Характеристика,Назначение,Склад,Упаковка,Количество,КоличествоУпаковок,Цена,Сумма,КодСтроки,Серия");
		НоваяСтрока.ДокументПоступления = ОснованиеПриемка;
	КонецЦикла;

КонецПроцедуры
